eisup_2019_docmng_integration/src/Documents/абс_ЗаявкаНаЗаведениеДоговоров/абс_ЗаявкаНаЗаведениеДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_ЗаявкаНаЗаведениеДоговоров</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДоговора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>120</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаВзаиморасчетов</name>
    <comment>(Общ) Определяет валюту взаиморасчетов по договору, не может меняться, если по договору проведен хотя бы один документ</comment>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Куратор</name>
    <type>
      <types>CatalogRef.СотрудникиОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздатьДоговорНаФизлицеИЮрлице</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВстречныйДоговор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.абс_СтатусыЗаявокНаЗаведениеДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаИзмененияСтатуса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <comment>(Общ)</comment>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Подключения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздатьДоговорНаЮрлице</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ЛицевойСчетБиллинга</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_Агент</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
</mdclass:Document>

eisup_2019_docmng_integration/src/InformationRegisters/абс_ИзменениеСтатусовЗаявкиНаЗаведениеДоговоров/абс_ИзменениеСтатусовЗаявкиНаЗаведениеДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_ИзменениеСтатусовЗаявкиНаЗаведениеДоговоров</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВнутреннийНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.абс_ЗаявкаНаЗаведениеДоговоров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатусЗаявки</name>
    <type>
      <types>EnumRef.абс_СтатусыЗаявокНаЗаведениеДоговоров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>СПоставщиком</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>СПокупателем</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>СКомитентом</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>СКомиссионером</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
    <comment>(Общ)</comment>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/ВидыУсловийДоговоровВзаиморасчетов/ВидыУсловийДоговоровВзаиморасчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыУсловийДоговоровВзаиморасчетов</name>
  <comment>(Упр)</comment>
  <enumValues>
    <name>БезДополнительныхУсловий</name>
  </enumValues>
  <enumValues>
    <name>СДополнительнымиУсловиями</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/абсСтатусыДоговоров/абсСтатусыДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абсСтатусыДоговоров</name>
  <enumValues>
    <name>Подготовка</name>
  </enumValues>
  <enumValues>
    <name>ПроверкаДФМ</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеПД</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеПервоеЛицо</name>
  </enumValues>
  <enumValues>
    <name>Регистрация</name>
  </enumValues>
  <enumValues>
    <name>Исполнение</name>
  </enumValues>
  <enumValues>
    <name>Закрытие</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
  <enumValues>
    <name>Отмена</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
  <enumValues>
    <name>Уточнение</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеБухгалтерией</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДВКУР</name>
  </enumValues>
  <enumValues>
    <name>ПроверкаКонтрагента</name>
  </enumValues>
  <enumValues>
    <name>ДополнительноеСогласование</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеПВП</name>
  </enumValues>
  <enumValues>
    <name>КорректировкаРеквизитовДоговора</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеПДСменаОтветственного</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДИБ</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДЭБ</name>
  </enumValues>
  <enumValues>
    <name>ДополнительноеСогласованиеБухгалтерией</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДирКСП</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеРуководителемПД</name>
  </enumValues>
  <enumValues>
    <name>ОдобрениеСДилиОСА</name>
  </enumValues>
  <enumValues>
    <name>Корректировка</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеОФКПослеКоррректировки</name>
  </enumValues>
  <enumValues>
    <name>ОтказПослеКорректировки</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеРуководителемБлока</name>
  </enumValues>
  <enumValues>
    <name>ttk_СогласованиеТехБлоком</name>
  </enumValues>
  <enumValues>
    <name>ttk_СогласованиеАудитором</name>
  </enumValues>
  <enumValues>
    <name>ttk_СогласованиеПДМКР</name>
  </enumValues>
  <enumValues>
    <name>ttk_СогласованиеДСиМТО</name>
  </enumValues>
  <enumValues>
    <name>ttk_СогласованиеТехническимДиректором</name>
  </enumValues>
  <enumValues>
    <name>ttk_СогласованиеКазначейством</name>
  </enumValues>
  <enumValues>
    <name>ttk_СогласованиеДТПиР</name>
  </enumValues>
  <enumValues>
    <name>ttk_СогласованиеАД</name>
  </enumValues>
  <enumValues>
    <name>ttk_ВалютныйКонтроль</name>
  </enumValues>
  <enumValues>
    <name>ttk_СогласованиеЦФК</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/абсТипыДоговоров/абсТипыДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абсТипыДоговоров</name>
  <enumValues>
    <name>Договор</name>
  </enumValues>
  <enumValues>
    <name>ДополнительноеСоглашение</name>
  </enumValues>
  <enumValues>
    <name>Приложение</name>
  </enumValues>
  <enumValues>
    <name>СоглашениеОКонфиденциальности</name>
  </enumValues>
  <enumValues>
    <name>ДоговорТрехсторонний</name>
  </enumValues>
  <enumValues>
    <name>ГосударственныйКонтракт</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/абс_СтатусыЗаявокНаЗаведениеДоговоров/абс_СтатусыЗаявокНаЗаведениеДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_СтатусыЗаявокНаЗаведениеДоговоров</name>
  <enumValues>
    <name>Подготовка</name>
  </enumValues>
  <enumValues>
    <name>ПроверкаНСИ</name>
  </enumValues>
  <enumValues>
    <name>Выполнена</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Documents/абс_ЗаявкаНаЗаведениеДоговоров/ObjectModule.bsl
Функция СоздатьДоговор(ВидДоговораТек, КонтрагентТек) Экспорт 
	
	мВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
	
	НовыйДоговор = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
	
	ЗаполнитьЗначенияСвойств(НовыйДоговор, ЭтотОбъект);
	
	НовыйДоговор.Номер                       = НомерДоговора;
	НовыйДоговор.Дата                        = ДатаДоговора;
	НовыйДоговор.абс_ДатаНачалаДействия      = ДатаДоговора;
	НовыйДоговор.абс_ДатаРегистрацииДоговора = ДатаДоговора; 
	НовыйДоговор.Владелец                    = КонтрагентТек;
	НовыйДоговор.ВедениеВзаиморасчетов       = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом;
	НовыйДоговор.ВидДоговора                 = ВидДоговораТек;
	НовыйДоговор.абс_Подключения             = Подключения;
	НовыйДоговор.абс_ЛицевойСчетБиллинга     = абс_ЛицевойСчетБиллинга;
	НовыйДоговор.абс_Агент                   = абс_Агент;
	
	Если КонтрагентТек.НеЯвляетсяРезидентом И ВидДоговораТек = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем Тогда
		НовыйДоговор.РеализацияНаЭкспорт = Истина;
	КонецЕсли;
	
	НовыйДоговор.ВидУсловийДоговора = Перечисления.ВидыУсловийДоговоровВзаиморасчетов.БезДополнительныхУсловий;
	
	Если ВидДоговораТек <> Перечисления.ВидыДоговоровКонтрагентов.Прочее Тогда
		НовыйДоговор.ВестиПоДокументамРасчетовСКонтрагентом = Истина;
	КонецЕсли;
	
	Если (ВидДоговораТек = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком
		ИЛИ  ВидДоговораТек = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем)
		И ВалютаВзаиморасчетов <> мВалютаРегламентированногоУчета Тогда
		НовыйДоговор.РасчетыВУсловныхЕдиницах = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновныеРасчетыПоДоговоруВУсловныхЕдиницах");
	КонецЕсли;
	
	Если ВидДоговораТек = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем Тогда
		НовыйДоговор.ПроцентПредоплаты = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнойРазмерПредоплатыПоЗаказуПокупателя");
	КонецЕсли;
	
	НовыйДоговор.ОбособленныйУчетТоваровПоЗаказамПокупателей = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнойОбособленныйУчетТоваровПоЗаказамПокупателей");
	
	Если (ВидДоговораТек = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем ИЛИ ВидДоговораТек = Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером) И ТипЗнч(НовыйДоговор.ТипЦен) <> Тип("СправочникСсылка.ТипыЦенНоменклатуры") Тогда
		НовыйДоговор.ТипЦен = Справочники.ТипыЦенНоменклатуры.ПустаяСсылка();
	ИначеЕсли (ВидДоговораТек = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком ИЛИ ВидДоговораТек = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом) И ТипЗнч(НовыйДоговор.ТипЦен) <> Тип("СправочникСсылка.ТипыЦенНоменклатурыКонтрагентов") Тогда
		НовыйДоговор.ТипЦен = Справочники.ТипыЦенНоменклатурыКонтрагентов.ПустаяСсылка();
	КонецЕсли; 

	НовыйДоговор.НалоговыйАгентПоОплате = Истина;
	
	НовыйДоговор.абс_СтатусДоговора  = Перечисления.абсСтатусыДоговоров.Исполнение;
	НовыйДоговор.абс_Ответственный   = глЗначениеПеременной("глТекущийПользователь"); 	
    НовыйДоговор.абс_ВидДеятельности = Справочники.абс_ВидыДеятельностиКТТК.НайтиПоНаименованию("Связь");
	НовыйДоговор.Наименование        = СокрЛП(НомерДоговора) + " от " + Формат(ДатаДоговора, "ДФ=dd.MM.yyyy");
	НовыйДоговор.абс_ВидДоговора     = Справочники.абс_ПредметДоговораГК.ДоговорОказанияУслуг;
    НовыйДоговор.абс_ТипДоговора     = Перечисления.абсТипыДоговоров.Договор;
	НовыйДоговор.абс_ДоговорБезСуммы = Истина;
	НовыйДоговор.абс_ДоходныйДоговор = ВстречныйДоговор;
	
	Если ЗначениеЗаполнено(Куратор) Тогда
		НовСтрокаКураторы = НовыйДоговор.абс_Кураторы.Добавить();
		НовСтрокаКураторы.Куратор = Куратор;
	КонецЕсли;
	
	Попытка
		НовыйДоговор.Записать();
		Возврат НовыйДоговор.Ссылка;
	Исключение
		#Если Клиент Тогда
			Предупреждение("Не удалось создать договор");
		#Иначе
			Сообщить("Не удалось создать договор");
		#КонецЕсли
		Возврат Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	КонецПопытки;
	
КонецФункции

Функция НайтиБПСогласованиеЗаявки() Экспорт
	
	Возврат абс_БизнесПроцессы.НайтиБизнесПроцессПоЗаявкеНаЗаведениеДоговора(Ссылка);
	
КонецФункции

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	НачатьТранзакцию();
	
	СтатусПоРегистру = абс_БизнесПроцессы.ПолучитьСтатусЗаявкиНаЗаведениеДоговораПоРегистру(Ссылка);
	
	Если НЕ Статус = СтатусПоРегистру Тогда
		ЗаписатьНовыйСтатус(Статус, ПричинаИзмененияСтатуса);		
	КонецЕсли;	
	
	// АБС Изменение Родин Отключение бизнес-процессов 110314	
	СогласованиеБезБП = глЗначениеПеременной("абс_СогласованиеБезБП");
	Если Не СогласованиеБезБП Тогда
		БПСогласованиеЗаявки = НайтиБПСогласованиеЗаявки();	
		
		Если НЕ ЗначениеЗаполнено(БПСогласованиеЗаявки) И Статус = Перечисления.абс_СтатусыЗаявокНаЗаведениеДоговоров.ПроверкаНСИ Тогда
			абс_БизнесПроцессы.ЗапуститьБПСогласованияЗаявкиНаЗаведениеДоговора(Ссылка);
		КонецЕсли;
		
		// Попробуем закрыть задачу переутверждения
		ЗадачаСогласованиеЗаявки = ПолучитьЗадачуПоСогласованиюЗаявкиНаЗаведениеДоговора();
		
		Если ЗначениеЗаполнено(ЗадачаСогласованиеЗаявки) Тогда
			Если Не ЗадачаСогласованиеЗаявки.Выполнена Тогда
				
				ЗадачаОбъект = ЗадачаСогласованиеЗаявки.ПолучитьОбъект();	
				ЗадачаОбъект.ВыполнитьЗадачу();
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	// АБС Изменение Родин Отключение бизнес-процессов 110314	
	
	ЗафиксироватьТранзакцию();		
	
КонецПроцедуры

Функция ПолучитьЗадачуПоСогласованиюЗаявкиНаЗаведениеДоговора() Экспорт
	
	БП = НайтиБПСогласованиеЗаявки();
	
	Если БП = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СпТочек = Новый Массив;
	
	//АБС ИЗМЕНЕНИЕ Урал 28.01.2014
	Если Ссылка.Статус = Перечисления.абс_СтатусыЗаявокНаЗаведениеДоговоров.Выполнена ИЛИ Ссылка.Статус = Перечисления.абс_СтатусыЗаявокНаЗаведениеДоговоров.Отказ Тогда
		
		СпТочек.Добавить(БизнесПроцессы.абс_СогласованиеЗаявкиНаЗаведениеДоговора.ТочкиМаршрута.ДействиеУтверждениеГруппойНСИ);
		
	ИначеЕсли Ссылка.Статус = Перечисления.абс_СтатусыЗаявокНаЗаведениеДоговоров.Подготовка Тогда
		
		СпТочек.Добавить(БизнесПроцессы.абс_СогласованиеЗаявкиНаЗаведениеДоговора.ТочкиМаршрута.ДействиеОтказаноВСогласовании);
		
	ИначеЕсли Ссылка.Статус = Перечисления.абс_СтатусыЗаявокНаЗаведениеДоговоров.ПроверкаНСИ Тогда
		
		СпТочек.Добавить(БизнесПроцессы.абс_СогласованиеЗаявкиНаЗаведениеДоговора.ТочкиМаршрута.ДействиеПовторнаяПодготовка);
	
	КонецЕсли;
	//\\АБС УРАЛ
	
	Возврат абс_БизнесПроцессы.НайтиЗадачуПоЗаявкеНаЗаведениеДоговора(БП, СпТочек);
	
КонецФункции

Процедура ЗаписатьНовыйСтатус(НовыйСтатус, Комментарий = Неопределено) Экспорт
	
	ТекПользователь = глЗначениеПеременной("глТекущийПользователь");
	
	НаборЗаписей = РегистрыСведений.абс_ИзменениеСтатусовЗаявкиНаЗаведениеДоговоров.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Заявка.Установить(Ссылка);
	НаборЗаписей.Прочитать();
	
	Запись = НаборЗаписей.Добавить();
	Запись.Период = абс_СерверныеФункции.ПолучитьДатуСервера();
	
	Запись.Заявка				= Ссылка;
	Запись.Пользователь 		= ТекПользователь;	
	Запись.СтатусЗаявки			= НовыйСтатус;
	
	Запись.Комментарий 			= Комментарий;
		
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ТекДата = абс_СерверныеФункции.ПолучитьДатуСервера();
	
	Если ЭтоНовый() Тогда
		Дата = ТекДата;
	КонецЕсли;
		
КонецПроцедуры
